<template>
  <Theory>
    <h1>Аккорд</h1>
    <p>
      Аккорд - набор 3 и более нот.
    </p>
    <p>
      Нижняя нота называется основанием аккорда (или основным тоном, примой).
      Когда говорят "Аккорд на *n* ступени", имеют в виду что эта ступень является основанием аккорда.
    </p>
    <p>
      Остальные ноты могут называться по интервалу, который они образуют с основанием.
      Например: терцовый тон (или просто "терция") - нота из аккорда, отстоящая на терцию от основания,
      квинтовый тон (или "квинта") - нота, отстоящая на квинту от основания.
    </p>
    <a name="triad"></a>
    <h2>Трезвучие</h2>
    <p>
      Трезвучие - аккорд из трёх нот, расположенных по терциям (между нижней и средней - терция, и между средней и верхней - терция).
    </p>
    <p>
      В зависимости от того, большие, или малые терции входят в трезвучие, выделяют виды трезвучий:
    </p>
    <table><tbody>
      <tr><td>Мажорное</td><td>б3 + м3</td></tr>
      <tr><td>Минорное</td><td>м3 + б3</td></tr>
      <tr><td>Уменьшённое</td><td>м3 + м3</td></tr>
      <tr><td>Увеличенное</td><td>б3 + б3</td></tr>
    </tbody></table>
    <p>
      У мажорного и минорного трезвучий крайние звуки образуют чистую квинту.
      У уменьшённого - уменьшённую квинту, у увеличенного - увеличенную.
    </p>
    <p>
      Трезвучие обозначается цифрами 53 (терция и квинта от основания):
      мажорное - Б53, минорное - М53, уменьшённое - Ум53, увеличенное - Ув53.
    </p>
    <p>
      Трезвучие, построенное на первой ступени является основным аккордом тональности.
      Оно состоит из I, III и V ступеней.
      Для обозначения такого трезвучия используют название тональности: G53, Am53, либо опуская цифры 53: C, Dm, E♭, F♯m.
    </p>
    <p>
      Уменьшённое трезвучие может обозначаться как -5, dim, m-5: E-5, G♯dim, D♭m-5.
    </p>
    <p>
      Увеличенное трезвучие может обозначаться как +5, aug: D+5, A♭aug.
    </p>
    <p>
      Примеры: <br/>
      (ми, соль♯, си) - мажорное трезвучие <br/>
      (си, ре, фа♯) - минорное трезвучие <br/>
      (фа♯, ля, до) - уменьшённое трезвучие <br/>
      (ре♭, фа, ля) - увеличенное трезвучие <br/>
    </p>
    <a name="seventh_chord"></a>
    <h2>Септаккорд</h2>
    <p>
      Септаккорд - аккорд из 4 звуков, расположенных по терциям.
      Между крайними звуками получается септима, откуда и название аккорда.
    </p>
    <p>
      Для классификации септаккордов удобно разделить их на трезвучие + септима от основания (терция к верхней ноте).
    </p>
    <div class="overflow-x-auto"><table class="table-borders whitespace-nowrap"><tbody>
      <tr><td>Б53 + м7</td><td>Малый мажорный,<br/>доминантсептаккорд</td><td>б3 + м3 + м3</td><td>мБ7</td></tr>
      <tr><td>Б53 + б7</td><td>Большой мажорный</td><td>б3 + м3 + б3</td><td>бБ7</td></tr>
      <tr><td>М53 + м7</td><td>Малый минорный</td><td>м3 + б3 + м3</td><td>мМ7</td></tr>
      <tr><td>М53 + б7</td><td>Большой минорный</td><td>м3 + б3 + б3</td><td>бМ7</td></tr>
      <tr><td>Ум53 + ум7</td><td>Уменьшённый</td><td>м3 + м3 + м3</td><td>умУм7</td></tr>
      <tr><td>Ум53 + м7</td><td>Полууменьшённый,<br/>малый уменьшённый</td><td>м3 + м3 + б3</td><td>мУм7</td></tr>
      <tr><td>Ув53 + б7</td><td>Большой увеличенный</td><td>б3 + б3 + м3</td><td>бУв7</td></tr>
    </tbody></table></div>
    <p>
      Обозначения: <br/>
      Малый мажорный - 7: C7, E♭7, A7 <br/>
      Большой мажорный - maj7, +7, Δ : Dmaj7, G+7, A♭Δ <br/>
      Малый минорный - m7: Em7, C♯m7, F♯m7 <br/>
      Большой минорный - mmaj7, m+7 или mΔ: Cmmaj7, E♭m+7, GmΔ <br/>
      Уменьшённый - dim7 или °, °7: F♯dim7, A°, D♯°7, иногда просто dim, вместо уменьшённого трезвучия: Cdim <br/>
      Полууменьшённый m7-5, Ø, Ø7 или mØ: Am7-5, G♯Ø, C♯Ø7, D♭mØ <br/>
      Большой увеличенный - +5maj7, +5+7, +Δ7: F+5maj7, G♭+5+7, E♭+Δ7 <br/>
    </p>
    <p>
      Примеры: <br/>
      C7 - (до, ми, соль, си♭) <br/>
      Fmaj7 - (фа, ля, до, ми) <br/>
      C♯m7 - (до♯, ми, соль♯, си) <br/>
      D♭mmaj7 - (ре♭, фа♭, ля♭, до) <br/>
      Gdim7 - (соль, си♭, ре, фа♭) <br/>
      Em7-5 - (ми, соль, си♭, ре) <br/>
      F+5maj7 - (фа, ля, до♯, ми) <br/>
    </p>
    <a name="add_interval"></a>
    <h2>С добавлением интервала</h2>
    <p>
      Если у аккорда указывается цифра 2, 4, или 6, это значит что к обычному трезвучию добавляется интервал от основания аккорда,
      соответствующий цифре.
      Секунда добавляется большая, кварта - чистая, секста - большая для мажорного трезвучия и малая для минорного.
    </p>
    <p>
      Например: <br/>
      C2 - (до, ре, ми, соль) <br/>
      F♯m4 - (фа♯, ля, си, до♯) <br/>
      G6 - (соль, си, ре, ми) <br/>
      Gm6 - (соль, си♭, ре, ми♭) <br/>
    </p>
    <p>
      Если вместе с 2 или 4 указывается “sus” (от sustain), то терция “задерживается” (не включается в аккорд).
      При этом мажорность или минорность теряет значение, так как III ступени в аккорде нет.
      Поэтому “msus” не пишут, используют только просто “sus”.
    </p>
    <p>
      Например: <br/>
      Dsus2 - (ре, ми, ля) <br/>
      Fsus4 - (фа, си♭, до) <br/>
    </p>
    <p>
      Если при пометке “sus” не указывается интервал, то обычно по умолчанию добавляется кварта (то есть то же самое что “sus4”).
    </p>
    <p>
      Если указывается какая-либо цифра со знаком + или -, то соответствующий интервал увеличивается или уменьшается.
      Под это правило подходят, в том числе, обозначения увеличенного и уменьшённого трезвучий: +5, -5 - квинта увеличенная, или уменьшённая.
    </p>
    <p>
      Если указывается цифра 9, то добавляются малая септима и нона (октава + секунда).
      Нона, как и секунда, по умолчанию добавляется большая.
      Если указывается “add9”, то добавляется только нона (то же самое что 2, с точностью до октавы).
      “maj9” - добавляются большая септима и нона.
      “+9”, “-9” - малая септима и увеличенная или малая нона (в соответствии с правилом для + и -).
    </p>
    <p>
      Например: <br/>
      C9 - (до, ми, соль, си♭, ре) <br/>
      Dm9 - (ре, фа, ля, до♯, ми) <br/>
      E♭add9 - (ми♭, соль, си♭, фа) <br/>
      F♯mmaj9 - (фа♯, ля, до♯, ми♯, соль♯) <br/>
      G+9 - (соль, си, ре, фа♯, ля♯) <br/>
      Am-9 - (ля, до, ми, соль, си♭) <br/>
    </p>
    <a></a>
    <h2 name="inversions">Обращения</h2>
    <p>
      Так же, как и у интервалов, перенос нижней ноты на октаву вверх образует обращение аккорда.
      Основанием становится нота, бывшая в аккорде второй снизу.
      Поскольку у аккорда больше двух нот, у него будет и больше одного обращения.
    </p>
    <a name="triad_inversions"></a>
    <h3>Обращения трезвучия</h3>
    <a name="first_triad_inversion"></a>
    <h4>Секстаккорд</h4>
    <p>
      При переносе нижней ноты трезвучия на октаву вверх основанием становится терцовый тон.
      От него до бывшей квинты остаётся терция, а до бывшего основания, которое теперь наверху получается секста.
    </p>
    <p>
      Обращение трезвучия с терцовым тоном в основании называется секстаккордом.
      Обозначение: Б6, М6.
    </p>
    <p>
      Например, секстаккорды <br/>
      До мажора - (ми, соль, до) <br/>
      Ми минора - (соль, си, ми) <br/>
      От ноты ре - (ре, фа, си♭) - си♭ мажор <br/>
      От ноты ля - (ля, до♯, фа♯) - фа♯ минор <br/>
    </p>
    <a name="second_triad_inversion"></a>
    <h4>Квартсекстаккорд</h4>
    <p>
      При переносе нижней ноты секстаккорда на октаву вверх основанием становится квинтовый тон начального трезвучия.
      От него до бывшего основания трезвучия получается кварта, а до бывшей терции трезвучия - секста.
    </p>
    <p>
      Обращение трезвучия с квинтовым тоном в основании называется квартсекстаккордом.
      Обозначение: Б64, М64.
    </p>
    <p>
      Например, квартсекстаккорды <br/>
      Фа мажора - (до, фа, ля) <br/>
      Ля минора - (ми, ля, до) <br/>
      От ноты си♭ - (си♭, ми♭, соль) - ми♭ мажор <br/>
      От ноты соль♯ - (соль♯, до♯, ми) - до♯ минор <br/>
    </p>
    <a name="seventh_chord_inversions"></a>
    <h3>Обращения септаккорда</h3>
    <p>
      В септаккорде ноты расположены от основания по интервалам: 3, 5, 7 (терция, квинта, септима).
    </p>
    <p>
      Обращения получаются такие:
    </p>
    <ul>
      <li>
        С терцовым тоном в основании интервалы получаются: 3, 5, 6.
        Обращение называется квинтсекстаккорд.
        Обозначение: мБ65, бБ65 и т.п.
      </li>
      <li>
        С квинтовым тоном в основании интервалы получаются: 3, 4, 6.
        Обращение называется терцквартаккорд.
        Обозначение: мБ43, мМ43 и т.п.
      </li>
      <li>
        С септимой в основании интервалы получаются: 2, 4, 6.
        Обращение называется секундаккорд.
        Обозначение: мУм2, бБ2 и т.п.
      </li>
    </ul>
    <a name="slash_notation"></a>
    <h3>Обозначение через бас</h3>
    <p>
      Обращение определяется по основанию, остальные ноты могут быть разбросаны по октавам как угодно.
      Поэтому часто пишут основной аккорд и бас.
      Например: C/E - секстаккорд до мажора.
      D7/A - малый мажорный терцквартаккорд ре мажора.
    </p>
    <p>
      Бывает, что нота в басу не учитывается при написании названия аккорда.
      Например: Am/G - то же самое что Am7/G - секундаккорд ля минора, Em/C - то же что Cmaj7 - большой мажорный септаккорд до мажора.
    </p>
  </Theory>
</template>

<script setup lang="ts">

</script>

<style scoped>
@import url('~/assets/theory.css');
</style>
