<template>
  <Theory>
    <h1>Интервал</h1>
    <p>
      Интервал - сочетание двух нот.
    </p>
    <p>
      Нижняя нота называется основанием интервала, а верхняя - вершиной.
      Когда говорят "Интервал на *n* ступени", имеют в виду, что эта ступень является основанием интервала.
    </p>
    <p>
      Названия интервалов происходят от итальянских порядковых числительных.
      Название определяется количеством ступеней от нижней ноты до верхней (включительно). 
    </p>
    <p>
      1 - прима (одна и та же ступень) <br/>
      2 - секунда (соседние ступени) <br/>
      3 - терция <br/>
      4 - кварта <br/>
      5 - квинта <br/>
      6 - секста <br/>
      7 - септима <br/>
      8 - октава <br/>
    </p>
    <p>
      Например:
      (соль, си) это терция, так как включает 3 ступени: соль, ля, си. <br/>
      (соль♯, си) это тоже терция, так как количество ступеней всё ещё равно 3: соль, ля, си. <br/>
      (ре, ля) это квинта, так как включает 5 ступеней: ре, ми, фа, соль, ля. <br/>
      (ре, ля♭) это тоже квинта, так как количество ступеней всё ещё равно 5: ре, ми, фа, соль, ля. <br/>
    </p>
    <p>
      Интервалы также классифицируют по расстоянию между нотами в тонах. 
      С помощью этой классификации можно различить такие интервалы как (ре, фа) и (ре, фа♯).
    </p>
    <p>
      Основные интервалы:
    </p>
    <ol class="ml-5">
      <li>Прима
        <ul class="ml-5">
          <li>Чистая - 0 тонов</li>
        </ul>
      </li>
      <li>Секунда
        <ul class="ml-5">
          <li>Малая - 0,5 тона</li>
          <li>Большая - 1 тон</li>
          <li>Увеличенная - 1,5 тона</li>
        </ul>
      </li>
      <li>Терция
        <ul class="ml-5">
          <li>Малая - 1,5 тона</li>
          <li>Большая - 2 тона</li>
        </ul>
      </li>
      <li>Кварта
        <ul class="ml-5">
          <li>Уменьшённая - 2 тона</li>
          <li>Чистая - 2,5 тона</li>
          <li>Увеличенная - 3 тона</li>
        </ul>
      </li>
      <li>Квинта
        <ul class="ml-5">
          <li>Уменьшённая - 3 тона</li>
          <li>Чистая - 3,5 тона</li>
          <li>Увеличенная - 4 тона</li>
        </ul>
      </li>
      <li>Секста
        <ul class="ml-5">
          <li>Малая - 4 тона</li>
          <li>Большая - 4,5 тона</li>
        </ul>
      </li>
      <li>Септима
        <ul class="ml-5">
          <li>Уменьшённая - 4,5 тона</li>
          <li>Малая - 5 тонов</li>
          <li>Большая - 5,5 тонов</li>
        </ul>
      </li>
      <li>Октава
        <ul class="ml-5">
          <li>Чистая - 6 тонов</li>
        </ul>
      </li>
    </ol>
    <p>
      Можно определять по расстоянию в тонах и другие виды интервалов, но на практике они редко встречаются.
    </p>
    <p>
      Такие интервалы (не шире октавы) называются простыми.
      Интервалы больше октавы, но меньше двух октав (например, нона - 9, или децима - 10),
      называются составными и могут быть представлены в виде: октава + простой интервал.
      Они наследуют свойства простых интервалов (нона, как и секунда, бывает малая, большая и увеличенная). <br/>
      Интервалы шире двух октав обычно не рассматриваются
      (в случае необходимости тоже могут быть представлены как простой интервал через *n* октав).
    </p>
    <p>
      Некоторые интервалы обозначают одну и ту же пару звуков, хотя являются разными.
      Например, большая терция (ми, соль♯) и уменьшённая кварта (ми, ля♭).
      Это всё ещё разные интервалы, их нельзя путать и заменять один на другой.
      В музыкальной теории имеет значение не только конкретное звучание,
      но и функция этого звучания в общем контексте, связь этого звучания с окружающими звуками.
      Такая функция связана со ступенью, которую звук занимает в текущем контексте.
    </p>
    <p>
      Примеры: <br/>
      (фа, ля) - терция, так как 3 ступени (фа, соль, ля), большая, так как от фа до ля 2 тона. <br/>
      (ми♭, си♭) - квинта, так как 5 ступеней (ми, фа, соль, ля, си), чистая, так как от ми♭ до си♭ 3,5 тона. <br/>
      (ре♯, си) - секста, так как 6 ступеней (ре, ми, фа, соль, ля, си), малая, так как от ре♯ до си 4 тона. <br/>
      (соль, ля♯) - секунда, так как 2 ступени (соль, ля), увеличенная, так как от соль до ля♯ 1,5 тона. <br/>
    </p>
    <p>
      Кратко интервалы обозначаются цифрой и буквенным сокращением. <br/>
      Например: <br/>
      м3 - малая терция <br/>
      ум7 - уменьшённая септима <br/>
      б6 - большая секста <br/>
      ч5 - чистая квинта <br/>
      ув4 - увеличенная кварта <br/>
    </p>
    <h2>Обращение</h2>
    <p>
      Если в простом интервале нижнюю ноту перенести на октаву вверх (поменять порядок нот, сделать вершину основанием),
      получится обращение интервала.
      Например, чистая кварта (фа, си♭) - обращение чистой квинты (си♭, фа).
      Большая терция (ля, до♯) - обращение малой сексты (до♯, ля).
    </p>
    <p>
      Сумма расстояний интервала и его обращения - 6 тонов (так как обращение - перенос нижней ноты на октаву вверх).
      Также сумма цифр, соответствующих количеству ступеней в интервале и его обращении всегда будет 9
      (октава - 8, и одна ступень посередине посчитана дважды).
      Таким образом, обращение малой секунды - всегда большая септима, обращение малой сексты - всегда большая терция и т.п.
    </p>
  </Theory>
</template>

<script setup lang="ts">
useHead({ title: 'Интервалы' });
</script>

<style scoped>
@import url('~/assets/theory.css');
</style>
