<template>
  <Theory>
    <a name='mode'></a>
    <h1>Лад</h1>
    <p>
      Лад - набор ступеней с определённой системой отношений между ними. <br/>
      Ступень лада будет соотноситься с набором нот с разностью в октаву или несколько октав
      (например, III ступень ля мажора - ноты до♯ во всех октавах).
    </p>
    <p>
      Наиболее распространены лады из 7 ступеней.
      Ступени лада соответствуют ступеням диатоники, то есть каждое название ноты (до, ре, ми, фа, соль, ля, си),
      возможно со знаками альтерации, соответствует ступени лада.
      Ступени принято обозначать римскими цифрами: I, II, III, IV, V, VI, VII. 
    </p>
    <p>
      Основные лады, которые мы будем использовать, - натуральный мажор (ионийский лад) и натуральный минор (эолийский лад).
      При отсутствии дополнительного пояснения под мажором и минором обычно подразумеваются натуральные мажор и минор.
      Будут встречаться также гармонические мажорный и минорный лады, часто в качестве дополнения к натуральным.
    </p>
    <a name="major"></a>
    <h2>Мажор</h2>
    <p>
      В натуральном мажоре расстояния между соседними ступенями такие:
    </p>
    <table><tbody>
      <tr><td>I - II</td><td>тон</td></tr>
      <tr><td>II - III</td><td>тон</td></tr>
      <tr><td>III - IV</td><td>полутон</td></tr>
      <tr><td>IV - V</td><td>тон</td></tr>
      <tr><td>V - VI</td><td>тон</td></tr>
      <tr><td>VI - VII</td><td>тон</td></tr>
      <tr><td>VII - I</td><td>полутон</td></tr>
    </tbody></table>
    <p>
      От первой ступени до следующей первой 6 тонов - октава.
    </p>
    <p>
      Можно представить соотношения в виде расстояний от первой ступени до всех остальных:
    </p>
    <table><tbody>
      <tr><td>I - II</td><td>1 тон</td><td>б2</td></tr>
      <tr><td>I - III</td><td>2 тона</td><td>б3</td></tr>
      <tr><td>I - IV</td><td>2,5 тона</td><td>ч4</td></tr>
      <tr><td>I - V</td><td>3,5 тона</td><td>ч5</td></tr>
      <tr><td>I - VI</td><td>4,5 тона</td><td>б6</td></tr>
      <tr><td>I - VII</td><td>5,5 тонов</td><td>б7</td></tr>
    </tbody></table>
    <p>
      В гармоническом мажоре VI ступень понижается на полтона.
      Остальные ступени такие же как в натуральном мажоре.
    </p>
    <p>
      К ладам мажорного наклонения также относятся Лидийский (натуральный мажор с повышенной IV ступенью)
      и Миксолидийский (натуральный мажор с пониженной VII ступенью).
    </p>
    <a name="minor"></a>
    <h2>Минор</h2>
    <p>
      В натуральном миноре расстояния между соседними ступенями такие:
    </p>
    <table><tbody>
      <tr><td>I - II</td><td>тон</td></tr>
      <tr><td>II - III</td><td>полутон</td></tr>
      <tr><td>III - IV</td><td>тон</td></tr>
      <tr><td>IV - V</td><td>тон</td></tr>
      <tr><td>V - VI</td><td>полутон</td></tr>
      <tr><td>VI - VII</td><td>тон</td></tr>
      <tr><td>VII - I</td><td>тон</td></tr>
    </tbody></table>
    <p>
      От первой ступени до следующей первой 6 тонов - октава.
    </p>
    <p>
      Можно представить соотношения в виде расстояний от первой ступени до всех остальных:
    </p>
    <table><tbody>
      <tr><td>I - II</td><td>1 тон</td><td>б2</td></tr>
      <tr><td>I - III</td><td>1,5 тона</td><td>м3</td></tr>
      <tr><td>I - IV</td><td>2,5 тона</td><td>ч4</td></tr>
      <tr><td>I - V</td><td>3,5 тона</td><td>ч5</td></tr>
      <tr><td>I - VI</td><td>4 тона</td><td>м6</td></tr>
      <tr><td>I - VII</td><td>5 тонов</td><td>м7</td></tr>
    </tbody></table>
    <p>
      В гармоническом миноре VII ступень повышается на полтона.
      Остальные ступени такие же как в натуральном миноре.
    </p>
    <p>
      К ладам минорного наклонения также относятся Дорийский (натуральный минор с повышенной VI ступенью)
      и Фригийский (натуральный минор с пониженной II ступенью).
    </p>
    <a name="major_minor_comp"></a>
    <h2>Сравнение мажора и минора</h2>
    <p>
      Можно заметить, что мажор и минор отличаются высотой III, VI и VII ступеней:
      в миноре каждая из них на полтона ниже чем в мажоре.
    </p>
    <p>
      Гармонические лады ближе друг к другу: они отличаются только третьей ступенью, VI у обоих взята из минора, а VII - из мажора.
      III ступень определяет мажорность или минорность лада.
    </p>
    <a name="key"></a>
    <h1>Тональность</h1>
    <p>
      Тональность - лад, привязанный к ноте (высотой положение лада). <br/>
      Тональность определяется ладом и первой ступенью.
    </p>
    <p>
      Ре мажор: первая ступень ре + мажорный лад. Определим ступени ре мажора. <br/>
      I ступень - ре <br/>
      II ступень - ре + тон = ми <br/>
      III ступень - ми + тон = фа♯.
      Именно фа♯, а не соль♭, так как следующая ступень после ми - всегда фа.
      Другими словами, между соседними ступенями всегда секунда (большая, малая или увеличенная),
      но никогда не терция, не прима, ни какой другой интервал (ведь названия интервалами даются как раз по количеству ступеней). <br/>
      IV ступень - фа♯ + полтона = соль <br/>
      V ступень - соль + тон = ля <br/>
      VI ступень - ля + тон = си <br/>
      VII ступень - си + тон = до♯ <br/>
    </p>
    <p>
      VI(г) - шестая ступень гармонического мажора - обычная VI, пониженной на полтона. То есть си♭.
    </p>
    <p>
      Итого, ре мажор:
    </p>
    <table><tbody>
      <tr><td>I</td><td>ре</td></tr>
      <tr><td>II</td><td>ми</td></tr>
      <tr><td>III</td><td>фа♯</td></tr>
      <tr><td>IV</td><td>соль</td></tr>
      <tr><td>V</td><td>ля</td></tr>
      <tr><td>VI</td><td>си</td></tr>
      <tr><td>VII</td><td>до♯</td></tr>
    </tbody></table>
    <p>
      Ре минор можно получить проделав такие же операции для минорного лада, либо опустив III, VI и VII ступени мажора.
    </p>
    <p>
      Ре минор:
    </p>
    <table><tbody>
      <tr><td>I</td><td>ре</td></tr>
      <tr><td>II</td><td>ми</td></tr>
      <tr><td>III</td><td>фа</td></tr>
      <tr><td>IV</td><td>соль</td></tr>
      <tr><td>V</td><td>ля</td></tr>
      <tr><td>VI</td><td>си♭</td></tr>
      <tr><td>VII</td><td>до</td></tr>
    </tbody></table>
    <p>
      VII(г) - седьмая ступень гармонического минора - обычная VII, повышенная на полтона. Это до♯.
    </p>
    <p>
      Тональности могут обозначаться несколькими способами: <br/>
      Английская система: <br/>
      • major - мажор, minor - минор: C-major, D-minor, E♭-major, F♯-minor <br/>
      • Большая буква - мажор, большая буква + "m" - минор: C, Dm, E♭, F♯m <br/>
      Немецкая система: <br/>
      • dur - мажор, moll - минор: C-dur, D-moll, Es-dur, Fis-moll <br/>
      • Большая буква: мажор, маленькая - минор: C, d, Es, fis <br/>
    </p>
    <a name="relative_keys"></a>
    <h2>Параллельные тональности</h2>
    <p>
      Посмотрим на ступени тональностей соль мажор и ми минор.
    </p>
    <div class="w-[50%] inline-block">
      <p>
        Соль мажор:
      </p>
      <table><tbody>
        <tr><td>I</td><td>соль</td></tr>
        <tr><td>II</td><td>ля</td></tr>
        <tr><td>III</td><td>си</td></tr>
        <tr><td>IV</td><td>до</td></tr>
        <tr><td>V</td><td>ре</td></tr>
        <tr><td>VI</td><td>ми</td></tr>
        <tr><td>VII</td><td>фа♯</td></tr>
      </tbody></table>
    </div>
    <div class="w-[50%] inline-block">
      <p>
        Ми минор:
      </p>
      <table><tbody>
        <tr><td>I</td><td>ми</td></tr>
        <tr><td>II</td><td>фа♯</td></tr>
        <tr><td>III</td><td>соль</td></tr>
        <tr><td>IV</td><td>ля</td></tr>
        <tr><td>V</td><td>си</td></tr>
        <tr><td>VI</td><td>до</td></tr>
        <tr><td>VII</td><td>ре</td></tr>
      </tbody></table>
    </div>
    <p>
      Такие две тональности (натурального мажора и минора), у которых набор нот одинаковый,
      только порядок ступеней отличается, называются параллельными.
    </p>
    <p>
      Исходя из расстояний между ступенями лада, в мажоре всегда VI ступень будет первой ступенью для параллельного минора,
      а в миноре III ступень - первой ступенью параллельного мажора.
    </p>
    <p>
      Некоторые пары параллельных тональностей: <br/>
      До мажор - ля минор <br/>
      Соль мажор - ми минор <br/>
      Фа мажор - ре минор <br/>
      Ре мажор - си минор <br/>
      Си-бемоль мажор - соль минор <br/>
    </p>
  </Theory>
</template>

<script setup lang="ts">
useHead({ title: 'Тональность' });
</script>

<style scoped>
@import url('~/assets/theory.css');
</style>
