<template>
  <Theory>
    <h1>Нота</h1>
    <p>
      Нота - обозначение музыкального звука.
    </p> 
    <p>
      В современной музыкальной системе приняты следующие названия нот: до, ре, ми, фа, соль, ля, си.
      Они образуют семь ступеней диатоники (наиболее распространённая система для обозначения соотношений между нотами).
      Между ними также есть промежуточные, для обозначения которых используют знаки альтерации (о них далее).
    </p>
    <p>
      В физике высота звука определяется частотой (в Герцах, Гц) звуковых колебаний.
      В музыке за точку отсчёта взята частота 440 Гц - это нота ля первой октавы.
    </p>
    <a name='octave'><h1>Октава</h1></a>
    <p>
      Звуки, частоты которых отличаются в 2, 4, 8 раз, кажутся похожими нашему слуху и имеют схожие свойства в музыкальном построении.
      Более того, исходя из свойств звуковых колебаний, при звучании физического инструмента всегда вместе со звуком основной частоты 
      (основного тона) звучат также, в том числе, и звуки частотой в 2 и в 4 раза больше (обертона).
      Расстояние между двумя звуками, частоты которых отличаются в 2 раза, называют октавой.
    </p>
    <p>
      Также октавой называют диапазон звуков шириной 1 октаву.
      За основную ноту при разделении на октавы используют ноту до.
      То есть октава - звуки от ноты "до" до ноты "си".
      Частота 440 Гц это ля первой октавы.
    </p>
    <p>
      Вверх от первой октавы по порядку идут: вторая, третья, четвёртая, пятая.
      <br/>
      Вниз от первой октавы по порядку идут: малая, большая, контроктава, субконтроктава.
    </p>
    <p>
      С периодом в октаву все названия нот повторяются, изменяется только название октавы.
      То есть частота 220 Гц соответствует ноте ля малой октавы, 1760 Гц - ля третьей октавы и т.п.
    </p>
    <a name='tone'><h1>Тон</h1></a>
    <p>
      В современной музыкальной системе используется равномерно темперированный строй:
      октава (расстояние) делится на 12 частей (в которых одинаковое отношение частот),
      и получается полутон - музыкальная единица измерения высоты.
      Два полутона образуют тон. Таким образом, тон - расстояние между звуками,
      отношение частот которых равно корню 6 степени из 2 (примерно 1,122462048).
    </p>
    <a name='distance_in_tones'><h2>Расстояние между нотами в тонах</h2></a>
    <p>
      Между нотами в одной октаве расстояния будут такие:
    </p>
    <p>
      До - ре: 1 тон <br/>
      Ре - ми: 1 тон <br/>
      Ми - фа: 0,5 тона (полутон) <br/>
      Фа - соль: 1 тон <br/>
      Соль - ля: 1 тон <br/>
      Ля - си: 1 тон <br/>
    </p>
    <p>
      От ноты си до ноты до следующей октавы остаётся 0,5 тона (так как октава - 6 тонов).
    </p>
    <a name='accidentals'><h1>Знаки альтерации</h1></a>
    <p>
      В музыке используются знаки, которые повышают или понижают звук без изменения названия ноты.
      Чаще всего используются диез(♯) и бемоль(♭).
      Диез повышает звук на полтона, а бемоль понижает на полтона.
      То есть нота до-диез на полтона выше чем до. Нота соль-бемоль на полтона ниже чем соль. 
    </p>
    <p>
      В записи на нотном стане также часто встречается знак бекар(♮). Он отменяет действие любых других.
    </p>
    <p>
      Иногда используются дубль-диез(𝄪) и дубль-бемоль(𝄫). Они повышают (или понижают, соответственно) ноту на тон.
    </p>
    <p>
      Добавление знаков альтерации не меняет ступень звукоряда. Ми-бемоль это та же ступень, что и ми.
      И соль-дубль-диез - та же ступень что и соль.
    </p>
    <p>
      Таким образом, любой звук можно представить в нотах несколькими способами.
      Например, соль-диез и ля-бемоль (в одной октаве) это один и тот же звук.
      Си-диез, до и ре-дубль-бемоль это тоже один и тот же звук.
      Однако не всегда грамотно заменять обозначение на другое, обозначающее тот же звук (соль-диез на ля-бемоль и т.п.),
      так как это разные ноты, разные ступени звукоряда и они будут иметь разное значение и свойства в музыкальной теории.
    </p>
    <a name='letters_notation'><h1>Буквенные обозначения</h1></a>
    <p>
      В записи часто используются обозначения нот латинскими буквами.
      Есть две наиболее распространённые системы обозначения:
    </p>
    <p>
      Английская нотация: <br/>
      A ля <br/>
      B си <br/>
      C до <br/>
      D ре <br/>
      E ми <br/>
      F фа <br/>
      G соль <br/>
    </p>
    <p>
      Немецкая нотация: <br/>
      A ля <br/>
      B си-бемоль <br/>
      C до <br/>
      D ре <br/>
      E ми <br/>
      F фа <br/>
      G соль <br/>
      H си <br/>
    </p>
    <p>
      Знаки альтерации добавляются просто приписыванием справа: F♯, D♭;
      либо приписыванием буквенных окончаний -is(диез) и -es(бемоль): Cis, Ges (исключения: ля-бемоль и ми-бемоль: As и Es).
    </p>
    <p>
      В немецкой нотации запись H♭ это ошибка, вместо этого пишут B.
      При этом остальные знаки (например: си-диез, си-дубль-бемоль) используют H: H♯, H𝄫.
      <br/>
      В английской нотации таких исключений нет.
    </p>
    <p>
      В англоязычных странах (в т.ч. в США) наиболее распространена английская система, в остальном мире (в т.ч. в России) - немецкая.
    </p>
  </Theory>
</template>

<script setup lang="ts">
useHead({ title: 'Ноты' });
</script>

<style scoped>
@import url('~/assets/theory.css');
</style>
